BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ПараметрыУчетаЭлеватора/ИНАГРО_ПараметрыУчетаЭлеватора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ПараметрыУчетаЭлеватора</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВестиМониторингПодозрительныхСобытий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиСкладскойУчетНегодныхОтходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиСправочникАвтомобилей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиСправочникВодителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиСправочникПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетКачестваНегодныхОтходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПолейТоковПоУслугам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПоПереработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПоФорме37Сводная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидВесаДляКонтроляПревышенияВПриказеНадОстатками</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидВесаДляКонтроляПриказа</types>
    </type>
  </resources>
  <resources>
    <name>ВключитьКонтрольНомераПробы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВладелецДляОтходов</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаДня</name>
    <comment>Все машины, пришедшие до этого времени считаются пришедшими вчера</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаДняПриОтгрузке</name>
    <comment>Все машины, пришедшие до этого времени считаются пришедшими вчера</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВывозДействителенОдинДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыставлятьУслугиОчисткиСушкиПоФактическимПоказателям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйКонтрольДоговоров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйПроцентОтклоненияВесаТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияТД</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияТМ</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЗаПереоформлениеПлатитНовыйВладелец</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретитьСозданиеЛабАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗачетныйВесРассчитыватьПоПоказателямДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтерактивноеФормированиеРеестровТТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСистемуКонтроляКачестваПартийЗерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДляРедактирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьМаксимальнуюГрузоподъемностьВесов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьОтрицательноеНетто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьПоследовательностьВводаВеса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольОстатковВЗачетномВесе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольПриказаВБизнесПроцессах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольПриказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЛабораторияРаботаетВСистеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяГрузоподъемностьВесов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеВестиУчетПоВидуХраненияВККУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НегодныеОтходы</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>НеДелатьДвижениеВККУПриОтсутствииЛабАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеПроводитьДокументамиРеестрТТНВывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеРассчитыватьУслугиЛабАнализаПриВывозе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеСписыватьЗачетныйВесГодныхОтходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеСписыватьОтходыСВладельцев</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьВесОбразцов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерЛабАнализаВФорме36</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаДляРасчетаУслуг</name>
    <type>
      <types>CatalogRef.УдалитьВнешниеОбработки</types>
    </type>
  </resources>
  <resources>
    <name>ОдинаковаяДатаФормСкладскойИРеестра</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойСпособХранения</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособХранения</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьАвтоматическоеНачислениеУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПобочныйПродукт</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ПрефиксУдаленныхДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтклоненияВывозимогоВесаОтВесаВПриказе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РассчитыватьХранениеПоФизическомуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РучноеУправлениеЗачетнымВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписыватьУсушкуПоСкладскомуУчету</name>
    <comment>Списывать по учету</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособКонтроляТары</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыКонтроляТары</types>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияОплатыЗаОчисткуСушку</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку</types>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияОплатыЗаУслугуЛабАнализа</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыНачисленияОплатыЗаАнализ</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаВесаНаОчисткуСушкуДляУслуг</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособРасчетаВесаНаОчисткуСушкуДляУслуг</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаНатуральнойСкидки</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыРасчетаНатуральнойСкидки</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаПредварительногоАктаРасчета</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыРасчетаПредварительногоАктаРасчета</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаУбылиОтОчистки</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыРасчетаУбылиОтОчистки</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПриказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтепеньКонтроляВесаТары</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>СтепеньКонтроляИзмененияВесаНакладной</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>СтепеньКонтроляОткрытияДокументов</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>ТипЦеныНоменклатуры</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВключитьИспользованиеКамеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользоватьСистемуФиксингаПриВвозе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПриПревышенииВесаОбосновывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатьяЗатратПродукции</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>УровеньКонтроляПревышенияВесаВПриказеНадОстатками</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьВТТНКачествоОтПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьМасличность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьСилосПриФормированииРеестраТТННаВвоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьБухДокументыПереоформленияОтражением</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРеестрыТТНВывозДляОтходов3Кат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СМС_ИспользоватьМеханизмУчетаОстатковКультурПоПартиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку/ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку</name>
  <enumValues>
    <name>БезУчетаТехнологическогоЦикла</name>
  </enumValues>
  <enumValues>
    <name>СначалаЧистимПотомСушим</name>
  </enumValues>
  <enumValues>
    <name>СначалаСушимПотомЧистим</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ПараметрыУчетаЭлеватора/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НеПроводитьДокументамиРеестрТТНВывозПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСистемуКонтроляКачестваПартийЗернаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСписыватьОтходыСВладельцевПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособНачисленияОплатыЗаОчисткуСушкуПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВестиМониторингПодозрительныхСобытийПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВесаДляКонтроляПревышенияНадОстаткамиВПриказеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
		
	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;	
	
	Элементы.ВыставлятьУслугиОчисткиСушкиПоФактическимПоказателям.Доступность = Запись.ИспользоватьСистемуКонтроляКачестваПартийЗерна;
	Элементы.СтепеньКонтроляВесаТары.Доступность							  = Запись.ВестиМониторингПодозрительныхСобытий;
	Элементы.СтепеньКонтроляИзмененияВесаНакладной.Доступность				  = Запись.ВестиМониторингПодозрительныхСобытий;
	Элементы.СтепеньКонтроляОткрытияДокументов.Доступность					  = Запись.ВестиМониторингПодозрительныхСобытий;		
	Элементы.УровеньКонтроляПревышенияВесаВПриказеНадОстатками.Доступность 	  = ЗначениеЗаполнено(Запись.ВидВесаДляКонтроляПревышенияВПриказеНадОстатками);
	Элементы.ФормироватьРеестрыТТНВывозДляОтходов3Кат.Доступность 			  = Запись.НеПроводитьДокументамиРеестрТТНВывоз;
	Элементы.ВладелецДляОтходов.Доступность								      = Запись.НеСписыватьОтходыСВладельцев;
	Элементы.ГруппаИсключения.Видимость	    		         				  = Запись.НеСписыватьОтходыСВладельцев;		
	Элементы.СпособРасчетаВесаНаОчисткуСушкуДляУслуг.Видимость				  = НЕ Запись.СпособНачисленияОплатыЗаОчисткуСушку = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку.БезУчетаТехнологическогоЦикла");
	
	Если Запись.СпособНачисленияОплатыЗаОчисткуСушку = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку.СначалаЧистимПотомСушим") Тогда
		Элементы.СпособРасчетаВесаНаОчисткуСушкуДляУслуг.Заголовок = НСтр("ru='Способ расчета веса на сушку:';uk='Спосіб розрахунку ваги на сушіння:'");
	ИначеЕсли Запись.СпособНачисленияОплатыЗаОчисткуСушку = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку.СначалаСушимПотомЧистим") Тогда
		Элементы.СпособРасчетаВесаНаОчисткуСушкуДляУслуг.Заголовок = НСтр("ru='Способ расчета веса на очистку:';uk='Спосіб розрахунку ваги на очищення:'");
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
